{
  "backend/main.mo": "Empty Motoko actor serving as a placeholder backend canister with no implemented functionality.",
  "feature_evidence.json": "Feature evidence report documenting four completed features related to migrating MindAR library from CDN to local bundling, including file changes, component dependencies, and test IDs.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files describing their purpose and key functionality, including AR components, controllers, UI elements, and asset placeholders.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining light and dark theme variables for a dark AR experience with mobile-first responsive design.",
  "frontend/index.html": "HTML entry point with mobile-optimized viewport settings and local MindAR library script loading from /lib/mindar/mindar-image-three.prod.js.",
  "frontend/public/lib/mindar/mindar-image-three.prod.js": "Placeholder file with instructions to download the actual MindAR v1.2.5 library (1.74 MB) from jsdelivr CDN and place it at this location for local bundling.",
  "frontend/public/targets/shirt-target.mind": "Placeholder for MindAR compiled image target file that must be generated from a T-shirt print image using the MindAR compiler tool.",
  "frontend/src/App.tsx": "Main React application component orchestrating WebAR experience with error handling for camera permissions and AR initialization, model selection, loading progress, and capture controls without network/CDN checks.",
  "frontend/src/components/CaptureControls.tsx": "Floating UI component in top-right corner with photo capture and video recording buttons, featuring recording state indicators and touch-friendly sizing.",
  "frontend/src/components/LoadingProgress.tsx": "Full-screen overlay component displaying 3D model loading progress with a progress bar, percentage indicator, and model name during preloading.",
  "frontend/src/components/ModelSelector.tsx": "Bottom-positioned carousel UI component with three animal model buttons (Bird, Bear, Deer) featuring emoji icons and active state highlighting.",
  "frontend/src/components/ScanInstructions.tsx": "Onboarding overlay component displaying AR instructions, checking camera permission state, providing browser-specific guidance for enabling camera access, and offering retry functionality for denied permissions.",
  "frontend/src/hooks/useActor.ts": "React hook that manages the backend actor instance using React Query, creating authenticated or anonymous actors based on Internet Identity state and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login/logout flows, identity state, and delegation validation with configurable AuthClient options.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom design tokens for dark theme, mobile-first responsive styles, and AR-specific viewport/touch handling for fullscreen AR experience.",
  "frontend/src/lib/animationController.ts": "Controls 3D model animations including emergence effects (scale-up with easeOutBack) and idle animations (breathing, bobbing, rotation) for AR models placed on tracked targets.",
  "frontend/src/lib/arController.ts": "Core AR controller that initializes MindAR with Three.js, manages camera tracking, handles model loading/switching, sets up lighting and shadows, and provides lifecycle methods for AR session management.",
  "frontend/src/lib/captureController.ts": "Handles photo and video capture of the AR scene by capturing the WebGL canvas, temporarily hiding UI elements, and providing download functionality with timestamped filenames.",
  "frontend/src/lib/modelLoader.ts": "Manages 3D model loading with GLTF/DRACO support, implements model caching, provides progress tracking, and creates fallback placeholder models when loading fails.",
  "frontend/src/lib/uiController.ts": "Manages UI state coordination including AR active status, selected animal model, recording state, and instructions visibility. Provides functions to handle model selection, AR start, and capture actions with validation.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient for data fetching and InternetIdentityProvider for authentication, then renders the main App component.",
  "frontend/src/types/mindar.d.ts": "TypeScript type declarations for the MindAR library, defining the MindARThree class interface and extending the Window object for locally bundled MindAR.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH color space, extended theme with sidebar/chart colors, custom animations for accordions, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state document describing a WebAR T-shirt experience with 5 animal 3D models using MindAR tracking and Three.js rendering. Lists 10 known issues including model loading, anchoring, lighting, UI layout, and animation problems that need fixing."
}